{
    "Programming":[
        {
         "Title":"Java SE (Standard Edition)",
         "Image":"https://t3.ftcdn.net/jpg/02/01/05/22/240_F_201052212_M2wpoRcv9qpysoPtHB8ruwnRekrVkHEx.jpg",
         "cardContent":"The Java SE (Standard Edition) course is designed to provide a solid foundation in the Java programming language, enabling students to build robust, platform-independent applications. This course covers the core Java concepts, libraries, and tools essential for developing stand-alone applications, preparing learners for advanced programming in enterprise environments and other Java frameworks."
        },
        {
         "Title":"C Programming",
         "Image":"https://t3.ftcdn.net/jpg/02/03/89/12/240_F_203891226_aX1909jQ0vRJUunAfIH0DcH07BKF1qCS.jpg",
         "cardContent":"The C Programming course introduces learners to one of the most powerful and widely used programming languages in software development. As the foundation for many modern programming languages, C provides the essential building blocks for writing efficient, low-level code. This course focuses on developing logical thinking, problem-solving skills, and understanding how memory management works, making it ideal for those looking to get into system programming or embedded development."
        },
        {
         "Title":"C++ Programming",
         "Image":"https://t4.ftcdn.net/jpg/09/90/60/75/240_F_990607548_QcxX7massY61kMoCHoYKTQPpe6qWQ116.jpg",
         "cardContent":"The C++ Programming course provides a comprehensive understanding of one of the most powerful and versatile programming languages used for system, application, and game development. C++ builds upon the foundation of the C language, adding object-oriented programming (OOP) capabilities and advanced features that support low-level programming as well as high-performance applications. This course is ideal for students and professionals who want to master both procedural and object-oriented programming concepts."
        },
        {
         "Title":"Python Programming",
         "Image":"https://t4.ftcdn.net/jpg/08/97/41/51/240_F_897415198_4Lgy7C7RAdCu6FDtlNFTs8hTr0kcgiOJ.jpg",
         "cardContent":"The Python Programming course is designed to provide a solid foundation in one of the most versatile and popular programming languages. Known for its simplicity and readability, Python is widely used in fields ranging from web development and data science to artificial intelligence and automation. This course is ideal for both beginners and experienced programmers looking to expand their knowledge and career opportunities."
        },
        {
         "Title":"HTML, CSS and JavaScript",
         "Image":"https://t3.ftcdn.net/jpg/04/25/50/06/240_F_425500686_9yvFLBYvIwwLp7oc0WyMiuipMVk93pW3.jpg",
         "cardContent":"This HTML, CSS, and JavaScript course is designed to introduce learners to the core technologies of web development. HTML structures the content of a webpage, CSS styles it, and JavaScript adds interactivity. Together, these technologies form the foundation for building modern, responsive websites and web applications. This course is ideal for beginners as well as aspiring front-end developers looking to gain hands-on experience in web technologies."
        },
        {
         "Title":"React JS",
         "Image":"https://t4.ftcdn.net/jpg/07/80/10/17/240_F_780101744_GaRWjrLEXrw3El5M5QkxhvZ2GUDS3DvV.jpg",
         "cardContent":"The React JS course provides in-depth knowledge of building dynamic, interactive, and high-performance web applications using React, one of the most popular front-end JavaScript libraries. Developed by Facebook, React focuses on creating reusable components and provides an efficient way to manage user interfaces. This course is ideal for developers aiming to build scalable, modern web applications and become proficient in front-end development."
        },
        {
         "Title":"React Native",
         "Image":"https://t3.ftcdn.net/jpg/04/33/86/50/240_F_433865030_lfnsOmrm8tb6TxqjiZw73CaXFDWQKDRv.jpg",
         "cardContent":"The React Native course equips learners with the skills needed to build cross-platform mobile applications using a single codebase. Developed by Facebook, React Native allows developers to create apps for both iOS and Android using JavaScript and React. This course is ideal for front-end developers, mobile enthusiasts, and anyone interested in learning how to build native-like mobile apps efficiently."
        },
        {
         "Title":"Kotlin",
         "Image":"https://t4.ftcdn.net/jpg/02/16/22/71/240_F_216227148_C1zrS49c1mjy1wlpaqBgbOOtgozOIRbK.jpg",
	         "cardContent":"The Kotlin course introduces learners to a powerful, modern, and concise programming language developed by JetBrains. Kotlin is officially supported by Google as the preferred language for Android development and can also be used for backend, web, and multi-platform development. This course is ideal for beginners and experienced developers who want to build Android apps or explore Kotlin’s versatility."
        },
        {
         "Title":"Flutter",
         "Image":"https://t3.ftcdn.net/jpg/05/23/24/34/240_F_523243495_2iP7zMxEAU5PdjiOvV902m83QjKIvsQI.jpg",
	         "cardContent":"The Flutter course provides comprehensive training in building cross-platform mobile applications using Flutter, Google’s UI toolkit. With Flutter, developers can create high-performance, visually appealing apps for Android, iOS, web, and desktop from a single codebase using the Dart programming language. This course is ideal for aspiring mobile app developers and professionals seeking to streamline their development process."
        },
        {
         "Title":"Dart",
         "Image":"https://t4.ftcdn.net/jpg/04/19/05/01/240_F_419050146_DDOOZ8FRtjx0KLt4Sekxk1W0YaNgkIbo.jpg",
         "cardContent":"The Dart course provides a solid foundation in Dart, the programming language developed by Google. Dart is known for being the primary language behind Flutter, a popular framework for building cross-platform mobile, web, and desktop applications. This course will teach learners the syntax, concepts, and advanced features of Dart, preparing them for both Flutter development and other standalone applications using Dart."
        },
        {
         "Title":"Django",
         "Image":"https://t3.ftcdn.net/jpg/07/49/20/64/240_F_749206438_zj2hemjtPNz6g9PR9Tq9xWTI4aDphed2.jpg",
         "cardContent":"The Django course offers an in-depth exploration of Django, a high-level Python web framework that encourages rapid development and clean, pragmatic design. Ideal for beginners and experienced developers alike, this course equips learners with the skills needed to build powerful, secure, and scalable web applications efficiently."
        }
        
       ]
}
